{
	"version": "https://jsonfeed.org/version/1",
	"title": "Jimmy Reekes III",
	"home_page_url": "https://www.jmreekes.com/",
	"feed_url": "https://www.jmreekes.com/feed.json",
	"items": [
		
		{
			"id": "http://jmreekes.micro.blog/2018/01/10/i-dont-know.html",
	      	
			"content_html": "<p>I don’t know why I hadn’t read any of the Jack Reacher novels before, but I don’t want to put down Killing Floor. 📚</p>\n",
			"date_published": "2018-01-09T23:35:00-05:00",
			"url": "https://www.jmreekes.com/2018/01/09/i-dont-know.html"
		},
		
		{
			"id": "http://jmreekes.micro.blog/2018/01/08/ive-been-thinking.html",
	      	
			"content_html": "<p>I’ve been thinking about what to do with my micro.blog. One of the first things I thought of is to do a travel journal of sorts of the interesting/unique/un-known airports I travel to. We all know of Cleveland, Ohio but how many know of Cleveland, Texas or Cleveland, Mississippi</p>\n",
			"date_published": "2018-01-07T23:07:00-05:00",
			"url": "https://www.jmreekes.com/2018/01/07/ive-been-thinking.html"
		},
		
		{
			"id": "http://jmreekes.micro.blog/2018/01/05/picture-of-the.html",
	      	
			"content_html": "<p>Picture of the sunset on New Year’s Eve from Nassau, Bahamas. </p>\n\n<p><img src=\"http://jmreekes.micro.blog/uploads/2018/a3597d8457.jpg\" width=\"600\" height=\"600\" /></p>\n",
			"date_published": "2018-01-04T23:06:00-05:00",
			"url": "https://www.jmreekes.com/2018/01/04/picture-of-the.html"
		},
		
		{
			"id": "http://jmreekes.micro.blog/2017/12/29/this-is-a.html",
	      	
			"content_html": "<p><em>This</em> is a <strong>simple</strong> test to verify MarsEdit is publishing correctly.</p>\n",
			"date_published": "2017-12-29T11:48:00-05:00",
			"url": "https://www.jmreekes.com/2017/12/29/this-is-a.html"
		},
		
		{
			"id": "http://jmreekes.micro.blog/2017/12/28/i-finished-moving.html",
	      	
			"content_html": "<p>I finished moving everything to FastMail yesterday. Gmail, iCloud, and my junk Yahoo account are all forwarding to FastMail, I have Gmail and iCloud sending identities setup so I can send using Gmail and iCloud SMTP servers. Calendars and Contacg have been moved as well. </p>\n",
			"date_published": "2017-12-28T11:41:00-05:00",
			"url": "https://www.jmreekes.com/2017/12/28/i-finished-moving.html"
		},
		
		{
			"id": "http://jmreekes.micro.blog/2017/12/25/we-saw-a.html",
	      	
			"content_html": "<p>We saw a Santa in a bass boat inflatable tonight while riding and looking at Christmas lights. Alistair (my 4 yr. old son) looks at it and says “Granddaddy’s boat is bigger”</p>\n",
			"date_published": "2017-12-24T20:49:00-05:00",
			"url": "https://www.jmreekes.com/2017/12/24/we-saw-a.html"
		},
		
		{
			"id": "http://jmreekes.micro.blog/2017/12/19/testing-out-out.html",
	      	
			"content_html": "<p>Testing out out <a href=\"micro.blog\">Micro.blog</a> for the first time. </p>\n",
			"date_published": "2017-12-19T15:13:00-05:00",
			"url": "https://www.jmreekes.com/2017/12/19/testing-out-out.html"
		},
		
		{
			"id": "http://jmreekes.micro.blog/2016/08/08/ulysses-v-review.html",
	      	
			"title": "Ulysses v2.6 review",
			
			"content_html": "<p>My favorite text editor, <a href=\"https://itunes.apple.com/us/app/ulysses/id950335311?mt=8&amp;uo=4&amp;at=1l3vx9E\">Ulysses</a>, just received an update to version 2.6, and it is amazing. There are a few additions to Ulysses in v2.6 but the biggest one has to be WordPress publishing for WordPress.com and self-hosted WordPress sites. This isn't just a publish a draft to WordPress option, nuh-uh, this is a full-blown, do it how you want, WordPress publishing. Whether you want to publish immediately, schedule it for a particular date and time, or publish a draft, Ulysses can do it. Ulysses also includes options for excerpt, featured image, tags, post type, slug, and title link options. Simply put, you should have no problem publishing to WordPress the way you want. Though not part of the WordPress publishing option, support for exporting as Rich Text was added and may be useful for SquareSpace users.</p>\n\n<p>I was lucky enough to get in on the beta around the same time I launched this site and moved <a href=\"https://pensandplanes.com/\">Pens and Planes</a> to WordPress and I've been using the WordPress publishing feature to publish my posts and it has worked flawlessly.</p>\n\n<p>Another new feature is Typewriter mode. Ulysses for Mac has had this for a long time but it's new to the iOS version and I love it. I rarely use my Mac for writing and had never used Typewriter mode before and wasn't sure how I would like it, but fell in love with it immediately. There are options to highlight the current line, sentence, or paragraph and an option to mark the current line which adds a grey box around the current line.</p>\n\n<p>Dropbox syncing was added in v2.6. iCloud syncing has worked flawlessly for me with Ulysses and I don't plan on changing to Dropbox syncing but I did try out Dropbox syncing and didn't had any issues with it.</p>\n\n<p>The Soulmen also added what they call Quick Open which allows you to search your entire library for text, keywords, or group names. VoiceOver support for the entire app was added as well.</p>\n\n<p>Ulysses is, without a doubt, my favorite writing app and version 2.6 makes it even better. Do yourself a favor and check it out. To read more about the version 2.6 update check out the <a href=\"http://ulyssesapp.com/blog/2016/08/ulysses-26/\">blog</a> post on the Ulysses site, <a href=\"https://brooksreview.net/2016/08/ulysses-mobile-26\">Ben Brook's</a> review, <a href=\"https://nahumck.me/something-different-something-new/\">Tim Nahumck's</a> review or <a href=\"https://www.macstories.net/linked/ulysses-2-6/\">Federico Viticci's</a> overview.</p>\n\n<p>Thanks for reading.</p>\n",
			"date_published": "2016-08-08T08:33:00-05:00",
			"url": "https://www.jmreekes.com/2016/08/08/ulysses-v-review.html"
		},
		
		{
			"id": "http://jmreekes.micro.blog/2016/07/19/slack-as-a.html",
	      	
			"title": "Slack as a Personal Information Center",
			
			"content_html": "<p><a href=\"https://twitter.com/sethclifford?lang=en\">Seth Clifford</a> has started using <a href=\"https://geo.itunes.apple.com/us/app/slack-team-communication/id618783545?mt=8&amp;uo=4&amp;at=1l3vx9E\">Slack</a> as a <a href=\"http://sethclifford.me/2016/07/an-update-on-how-im-using-my-private-slack-team/\">personal information center</a> and it is one of the best uses for Slack that I have seen. I'm a member of a few Slack teams and spend a fair bit of time in Slack, so Seth's idea of using Slack as a personal information center just clicked and I was like \"Why didn't I think of this before?\"</p>\n\n<p>I like the channel layout and usage Seth describes and I used that as a basis for my personal Slack.  The channels I'm currently using are:</p>\n\n<ul>\n    <li>alerts: Twitter follower notifications (via IFTTT) are the only alerts I have set here right now but I&#039;m in the process of adding more. </li>\n    <li>blogposts: This serves the exact purpose that Seth describes in his article, an easy reference for any blog posts I publish. </li>\n    <li>daily: This one is borrowed from Seth&#039;s article. I like the concept of it, but I&#039;m not sure if it&#039;s for me. I have no work projects or deadlines that I have to worry about, and what minor house projects I do have are kept in 2Do and don&#039;t have a due date. The only thing I&#039;m using this channel for right now is to keep track of any new calendar events or changes to current ones, so I may rename this channel to calendar.</li>\n    <li>nuzzle: Any notifications from Nuzzel are sent here. </li>\n    <li>pricedrops: Tweets from <a href=\"https://mobile.twitter.com/MacStoriesDeals\">@MacStoriesDeals</a> are sent here via IFTTT.</li>\n    <li>snippets: Random quotes or bits of info are stored here.</li>\n    <li>video: YouTube links that I come across that I may want to watch later are stored or copied here. I was using Drafts for this, but I like Slack better for this because Slack shows the title of the video in the posted link. </li>\n</ul>\n\n<p>I love the idea of using Slack to keep track of alerts and notifications because I can view all the alerts I've received without having to worry about an alert disappearing from Notification Center and not being able to find the information or article that was in that alert. My personal Slack is still a work in progress but I'm really happy with it so far.</p>\n\n<p>I would love to know if you use Slack as a personal information center and how you use it. Thanks for reading.</p>\n",
			"date_published": "2016-07-19T08:17:00-05:00",
			"url": "https://www.jmreekes.com/2016/07/19/slack-as-a.html"
		},
		
		{
			"id": "http://jmreekes.micro.blog/2016/06/07/refreshed-in-the.html",
	      	
			"title": "Refreshed in the Wind",
			
			"content_html": "<p>I have always enjoyed watching airplanes take off and land, and fly overhead. As a kid, whenever we drove past an airport I remember looking as hard as I could in the hopes I would see an airplane, even if I knew I wouldn’t see one.<sup><a id=\"ffn1\" class=\"footnote\" href=\"#fn1\">1</a></sup>  I can remember my dad stopping on the side of the road to let me watch a plane take off or land. My son is the same way I was as a kid, and yes, I have stopped the car to let him watch an airplane. Why do we do this? I was reminded earlier of a quote from one of my favorite books that I think perfectly describes why.</p>\n\n<blockquote>“\"...Here, refreshed in the wind, I rediscover what I had previously held to be certain truths. I again become aware that no pilot alive can resist watching a plane take oﬀ or land. He may pass a motionless airplane without noticing it, but the moment his ears detect the ﬁrst burst of power from a plane, however distant, he will turn his head regardless of everything else around him and watch it. \"He will also rudely break oﬀ in the middle of a conversation to watch a plane landing, though there may be a constant ﬂow of them. From observance of such activity he enjoys an abiding satisfaction, as basic and everlasting as that found by a deep-sea sailor on his obligatory pilgrimage to the nearest harbor...\"”\n\n— Ernest Gann in Fate Is The Hunter</blockquote>\n\n<p>The “refreshed in the wind” line has always stuck with me, because of a feeling I sometimes get at airports when the wind is just right. It is a feeling of calm and peace, and it is in those times that I’m grateful that I am able to do what I love. I don’t know why I get this feeling when the wind is a certain way, I just do. I get this feeling the strongest on clear days, when the temperature is around 75 to 80°F, and the wind is about 5 to 10 knots. When I get this feeling all I want to do is stop and watch the airplanes take off and land, and simply take in the sights, sounds, smells, and as crazy as it may sound to some, the beauty of the airport. As stressful as my job can get, it is in these times that I am refreshed in the wind, that I can’t imagine doing anything else.</p>\n\n<ol id=\"footnotes\">\n    <li id=\"fn1\">Who am I kidding, I still do it as an adult. <a href=\"#ffn1\">↩</a></li>\n</ol>\n",
			"date_published": "2016-06-07T13:39:00-05:00",
			"url": "https://www.jmreekes.com/2016/06/07/refreshed-in-the.html"
		}
		
	]
}
